# Definition Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Definition Properties
Definition Class See Also
---
The Definition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Name | The user visible name for the parameter. |
| ParameterGroup | Returns the group ID of the parameter definition. |
| ParameterType | **Obsolete.** Returns the user visible interpretation of the parameter data. |

# See Also
Definition Class
Autodesk.Revit.DB Namespace